[
  {
    "id": "ai-python-dev-2025",
    "title": "AI and Python Developer",
    "company": "Addmin Web World",
    "companyLogo": "https://addminwebworld.com/img/admologo-removebg.png",
    "position": "Full-time",
    "location": "Chandigarh, India",
    "startDate": "2025-06-01",
    "isCurrent": true,
    "description": "Developing and integrating AI models with SIP call agents to enable intelligent responses and function triggering. Leading projects involving OpenAI agent SDKs for hiring automation and previously for taxi booking services.",
    "responsibilities": [
      "Integrate LLMs and AI models with SIP call agents for real-time dialogue and function execution",
      "Design and deploy AI-driven workflows for customer and business automation",
      "Develop prompt engineering strategies for diverse agent tasks",
      "Lead new project for hiring automation using OpenAI agent SDKs",
      "Previously built and maintained AI-powered taxi booking agent system",
      "Collaborate with cross-functional teams to deploy scalable AI solutions",
      "Implement backend APIs and services using Django and FastAPI",
      "Developed an LLM-based automation platform for cab-service call handling, cutting manual intervention by 40%.",
      "Built an AI-driven recruitment screening system that filters and ranks candidates, reducing HR review time by 50%.",
      "Designed Tableau dashboards tracking automation KPIs including response latency, success rates, and efficiency gains."
    ],
    "skills": [
      "Python",
      "LLMs",
      "Prompt Engineering",
      "SIP Integration",
      "OpenAI API",
      "FastAPI",
      "Django",
      "Voice Bots",
      "Function Calling",
      "API Integration",
      "Webhooks",
      "Twilio",
      "Dialog Management",
      "Hiring Automation",
      "Taxi Booking Automation",
      "Tableau"
    ],
    "projectIds": [
      "llm-agent-integration",
      "recruitment-automation-platform"
    ],
    "featured": true
  },
  {
    "id": "data-scientist-cis-2024",
    "title": "Data Scientist",
    "company": "Corporate Incentive Solutions Pvt. Ltd.",
    "companyLogo": "https://www.cispl.net.in/corporates/images/logo.png",
    "position": "Full-time",
    "location": "Chandigarh, India",
    "startDate": "2024-09-01",
    "endDate": "2025-05-31",
    "isCurrent": false,
    "description": "Modernized insurance analytics by rebuilding legacy Excel reporting in modern BI stacks and automating KPI delivery for business leadership.",
    "responsibilities": [
      "Migrated fatality-claim dashboards from Excel into Power BI, Tableau, and Qlik Sense/QlikView for automated visualization and scheduling.",
      "Automated monthly, quarterly, and annual claim reports with Python ETL pipelines and Plotly-based analytics.",
      "Delivered dashboards for growth forecasts and operational metrics to drive data-backed planning decisions.",
      "Built analytics to track claim trends, processing time, and anomalies, reducing manual reporting effort by 60%."
    ],
    "skills": [
      "Power BI",
      "Tableau",
      "Qlik Sense",
      "QlikView",
      "Python",
      "Plotly",
      "ETL",
      "Insurance Analytics",
      "Automation",
      "Data Visualization",
      "Excel",
      "KPI Reporting"
    ],
    "projectIds": [
      "qlik-powerbi-suite",
      "fatality-claims-analytics"
    ],
    "featured": true
  },
  {
    "id": "ds-ml-intern-plantoai-2024",
    "title": "Data Science and ML Intern",
    "company": "planto.ai (Coding Pro)",
    "companyLogo": "https://planto.ai/images/planto-logo.png",
    "position": "Internship",
    "location": "Remote",
    "startDate": "2024-06-01",
    "endDate": "2024-09-30",
    "isCurrent": false,
    "description": "Worked on the creation of the planto.ai product, a VS Code extension. Responsible for designing the GUI in VS Code and integrating LLMs for improved responses and context management during the initial phases of the project. Gained valuable experience collaborating with the team and building a real-world AI product.",
    "responsibilities": [
      "Designed and implemented the GUI for the planto.ai VS Code extension",
      "Integrated LLMs for better context management and response quality",
      "Collaborated with the team to shape the initial phases of the product",
      "Worked primarily with TypeScript and Next.js",
      "Developed AI-powered features for the VS Code copilot extension with fine-tuning and UX enhancements across 16+ languages."
    ],
    "skills": [
      "TypeScript",
      "Next.js",
      "VS Code Extension Development",
      "LLMs",
      "Context Management",
      "GUI Design",
      "AI Integration",
      "Team Collaboration"
    ],
    "projectIds": [
      "plantoai-vscode-copilot"
    ],
    "links": {
      "company": "https://codingpro.online/",
      "project": "https://planto.ai/"
    },
    "featured": false
  }
]